Repository: circuitsacul/Starboard-2
Catalog: app/locale/*/LC_MESSAGES/bot.po
Languages: pt_br

source: Changed Settings:
pt_br: Configurações Alteradas:

source: No changed settings.
pt_br: Nenhuma configuração alterada.

source: None
pt_br: Nenhum

source: I couldn't interpret `{0}` as a hex value. Please pass something like `#FFE16C`.
pt_br: Eu não consegui interpretar `{0}` como um valor hexadecimal. Por favor, passe algo como `#FFE16C`.

source: I couldn't interpret `{0}` as yes or no. Please pass one of 'yes', 'no', 'true', or 'false'.
pt_br: Eu não consegui interpretar `{0}` como sim ou não. Por favor, passe 'yes', 'no', 'true' ou 'false'.

source: I couldn't interpret `{0}` as an integer (number). Please pass something like `10` or `2`.
pt_br: Eu não consegui interpretar `{0}` como um número inteiro. Por favor, passe algo como `10` or `2`.

source: I couldn't interpret `{0}` as a floating-point number. Please pass something like `10.9` or `6`.
pt_br: Eu não consegui interpretar `{0}` como um número de ponto flutuante. Poir favor, passe algo como `10.9` or `6`.

source: A role cannot be both an XPRole and a PosRole.
pt_br: Um cargo não pode ser ao mesmo tempo um XPRole e um PosRole.

source: {0} is already a PosRole.
pt_br: {0} já é um PosRole.

source: {0} is not a PosRole.
pt_br: {0} não é um PosRole.

source: {0} is already an XPRole.
pt_br: {0} já é um XPRole.

source: {0} is not a XPRole.
pt_br: {0} não é um XPRole.

source: **{0}** is already a PermRole on the PermGroup **{1}**.
pt_br: **{0}** já é um PermRole no PermGroup **{1}**.

source: **{0}** is not a PermRole on the PermGroup **{1}**.
pt_br: **{0}** não é um PermRole no PermGroup **{1}**.

source: I couldn't find any PermGroups with the name **{0}**.
pt_br: Eu não consegui encontrar nenhum PermGroups com o nome **{0}**.

source: **{0}** is already the name of another PermGroup.
pt_br: **{0}** já é o nome de um outro PermGroup.

source: {0} is not an emoji.
pt_br: {0} não é um emoji.

source: {0} is an emoji, but from another server. Please pass a default emoji or a custom emoji from this server.
pt_br: {0} é um emoji, mas de outro servidor. Passe um emoji padrão ou um emoji personalizado deste servidor.

source: The channel {0} is not a starboard.
pt_br: O canal {0} não é um starboard.

source: `{0}` is not a valid command.
pt_br: `{0}` não é um comando válido.

source: `{0}` is not a valid command or category.
pt_br: `{0}` não é um comando válido ou uma categoria válida.

source: The channel {0} is not an AutoStar channel.
pt_br: O canal {0} não é um canal AutoStar.

source: {0} is not an emoji on the AutoStar channel {1}.
pt_br: {0} não é um emoji no canal AutoStar {1}.

source: {0} is already an emoji on the AutoStar channel {1}.
pt_br: {0} já é um emoji no canal AutoStar {1}.

source: {0} is not an emoji on the starboard {1}.
pt_br: {0} não é um emoji no starboard {1}.

source: {0} is not blacklisted on {1}.
pt_br: {0} não está na lista negra em {1}.

source: {0} is already blacklisted on {1}.
pt_br: {0} já está na lista negra em {1}.

source: {0} is not whitelisted on {1}.
pt_br: {0} não está na lista branca em {1}.

source: {0} is already whitelisted on {1}.
pt_br: {0} já está na lista branca em {1}.

source: {0} is not a valid language code.
pt_br: {0} não é um código de idioma válido.

source: That message does not exist in the database.
pt_br: Essa mensagem não existe na base de dados.

source: The command `{0}` is not disabled.
pt_br: O commando `{0}` não está desabilitado.

source: {0} is already a starboard.
pt_br: {0} já é um starboard.

source: The command `{0}` is already disabled.
pt_br: O comando `{0}` já está desabilitado.

source: That emoji is already used for another QuickAction
pt_br: Esse emoji já é usado para um outro QuickAction

source: {0} is already a prefix.
pt_br: {0} já é um prefixo.

source: A channel cannot be both a starboard and an AutoStar channel
pt_br: Um canal não pode ser ao mesmo tempo um starboard e um canal AutoStar

source: Message {0} not found.
pt_br: Mensagem {0} não encontrada.

source: **{0}** is a required argument that you didn't pass.
pt_br: **{0}** é um argumento obrigatório que você não passou.

source: Channel {0} not found.
pt_br: Canal {0} não encontrada.

source: I can't read messages in {0}.
pt_br: Eu não consigo ler mensagens em {0}.

source: Role {0} not found.
pt_br: Cargo {0} não encontrado.

source: User {0} not found.
pt_br: Usuário {0} não encontrado.

source: You are on cooldown. Try again in {0}s.
pt_br: Você está no tempo de espera. Tente novamente em {0} s.

source: Expected closing {0}.
pt_br: Encerramento do comando esperado: {0}.

source: This server does not have premium, which is required to use this command.
pt_br: Este servidor não possui premium, que é necessário para usar este comando.

source: The command `{0}` has been disabled by the moderators of this server.
pt_br: O comando `{0}` foi desabilitado pelos moderadores deste servidor.

source: This command is being used too much. Please wait and try again.
pt_br: Este comando está sendo usado demais. Por favor, aguarde e tente novamente.

source: Bot requires the following permissions to run this command: {0}
pt_br: O bot requer as seguintes permissões para executar este comando: {0}

source: This command cannot be used in private messages.
pt_br: Este comando não pode ser usado em mensagens privadas.

source: This command can only be used by the bot owner.
pt_br: Este comando só pode ser usado pelo dono do bot.

source: minChars cannot be less than 0.
pt_br: minChars não pode ser menor que 0.

source: minChars cannot be grater than 2,000.
pt_br: minChars não pode ser maior que 2.000.

source: MaxUsers must be greater than 0.
pt_br: MaxUsers deve ser maior que 0.

source: The cooldown ammount must be greater than 0.
pt_br: A quantidade de tempo de espera deve ser maior que 0.

source: The cooldown time must be 0 or greater.
pt_br: O tempo de espera deve ser 0 ou maior.

source: The cooldown time can be at most 10 minutes (600 seconds).
pt_br: O tempo de espera pode ser de no máximo 10 minutos (600 segundos).

source: requiredStars cannot be less than or equal to requiredRemove.
pt_br: requiredStars não pode ser menor ou igual a requiredRemove.

source: requiredStars cannot be less than 1.
pt_br: requiredStars não pode ser menor que 1.

source: requiredStars cannot be greater than 500.
pt_br: requiredStars não pode ser maior que 500.

source: requiredRemove cannot be less than -1.
pt_br: requiredRemove não pode ser menor que -1.

source: requiredRemove cannot be greater than 495.
pt_br: requiredRemove não pode ser maior que 495.

source: Required must be greater than 0.
pt_br: Required deve ser maior que 0.

source: Page {0}/{1}
pt_br: Página {0}/{1}

source: Stop
pt_br: Pare

source: Prev
pt_br: Página anterior

source: Next
pt_br: Próxima página

source: You can't use this menu.
pt_br: Você não pode usar este menu

source: No
pt_br: Não

source: Yes
pt_br: Sim

source: Required Permissions
pt_br: Permissões Obrigatórias

source: Usage
pt_br: Uso

source: Aliases
pt_br: Apelidos

source: Type {help.clean_prefix}commands <command> for more info on a command. You can also type {help.clean_prefix}commands <category> for more info on a category.
pt_br: Digite {help.clean_prefix}commands <comando> para obter mais informações sobre um comando. Yocê também pode digitar {help.clean_prefix}commands <categoria> para obter mais informações sobre umacategoria.

source: You can now choose your personal and server language. Use `{p}guildLang <language>` to set the language for the server (applies to starboard messages, level up messages, etc.), or `{p}lang <language>` to set your personal language. Valid Languages: {languages}
pt_br: Agora você pode escolher seu idioma pessoal e o idioma do servidor. Use `{p}guildLang <idioma>` para definir o idioma do servidor (aplica-se a mensagens do starboard, mensagens de subida de nível, etc.) ou `{p}lang <idioma>` para definir sua linguagem pessoal. Idiomas Válidos: {languages}

source: That is already a starboard. Run the wizard anyways?
pt_br: Isso já é um starboard. Executar o assistente mesmo assim?

source: Do you want to (1) create a new channel or (2) use an existing channel?
pt_br: Você deseja (1) criar um novo canal ou (2) usar um canal existente?

source: What channel should I setup a new starboard in?
pt_br: Em que canal devo configurar um novo starboard?

source: What should the channel be named?
pt_br: Qual deve ser o nome do canal?

source: How many stars should a message need to appear on the starboard?
pt_br: De quantas estrelas uma mensagem precisa para aparecer no starboard?

source: Should users be allowed to star their own messages?
pt_br: Os usuários devem ter permissão para estrelar as suas próprias mensagens?

source: What emojis should count as "stars"?
pt_br: Quais emojis devem contar como "estrelas"?

source: Creating webhook for starboard messages.
pt_br: Criando webhook para mensagens do starboard.

source: *Message was deleted*
pt_br: *A mensagem foi excluída*

source: *File Only*
pt_br: *Apenas arquivo*

source: **[Replying to {0}]({1})**
pt_br: **[Respondendo a {0}]({1})**

source: **[Replying to Unknown (deleted)](https://discord.com/channels/{0.guild_id}/{0.channel_id}/{0.message_id})**
pt_br: **[Respondendo a um Desconhecido (deleted)](https://discord.com/channels/{0.guild_id}/{0.channel_id}/{0.message_id})**

source: **[Jump to Message]({0})**
pt_br: **[Ir para a Mensagem]({0})**

source: Trashed Message
pt_br: Mensagem Destruída

source: This message was trashed by a moderator. To untrash it, run ``` untrash {0}-{1}``` Reason:``` {2}```
pt_br: Esta mensagem foi destruída por um moderador. Para reconstruí-lo, execute ``` untrash {0}-{1}``` Motivo:``` {2}```

source: I tried to match `{0}` to [a message]({1}), but it took too long. Try improving the efficiency of your regex. If you need help, feel free to join the support server.
pt_br: Eu tentei corresponder `{0}` a [uma mensagem]({1}), mas demorou muito tempo. Tente melhorar a eficiência de sua regex. Se precisar de ajuda, sinta-se à vontade para juntar-se ao servidor de suporte.

source: I tried to send a starboard message to {0}, but I'm missing the proper permissions. Please make sure I have the `Send Messages` permission.
pt_br: Eu tentei enviar uma mensagem de starboard para {0}, mas eu estou sem as permissões apropriadas. Por favor, certifique-se de que eu tenho a permissão `Enviar mensagens`.

source: I tried to autoreact to a message on the starboard, but I'm missing the proper permissions. If you don't want me to autoreact to messages, set the AutoReact setting to False with `starboards cs #{0} --autoReact False`.
pt_br: Eu tentei reagir automaticamente a uma mensagem no starboard, mas eu não tenho as permissões apropriadas. Se você não quer que eu reaja automaticamente às mensagens, defina a configuração AutoReact como `False` (falsa) com `starboards cs #{0} --autoReact False`.

source: Manage starboards.
pt_br: Gerencie starboards.

source: Runs a setup wizard to create a starboard.
pt_br: Executa um assistente de configuração para criar um starboard.

source: List starboards.
pt_br: Liste starboards.

source: You do not have any starboards. Add starboards with `{0}s add #channel`.
pt_br: Você não tem nenhum starboard. Adicione starboards com `{0}s add #canal`.

source: Starboards for **{0}**:
pt_br: Starboards de **{0}**:

source: This lists the starboards and their most important settings. To view all settings, run `{0}starboards #starboard`.
pt_br: Isto lista os starboards e as configurações mais importantes deles. Para ver todas as configurações, execute `{0}starboards #starboard`.

source: Deleted Channel {0}
pt_br: Canal Excluído {0}

source: Adds a starboard.
pt_br: Adiciona um starboard.

source: Created starboard {0}.
pt_br: Starboard criado {0}.

source: Removes a starboard.
pt_br: Remove um starboard.

source: Are you sure? All starboard messages will be lost.
pt_br: Você tem certeza? Todas as mensagens de starboard serão perdidas.

source: {0} is no longer a starboard.
pt_br: {0} não é mais um starboard.

source: Cancelled.
pt_br: Cancelado.

source: Whether or not to use webhooks for starboard messages.
pt_br: Se deve usar ou não webhooks para mensagens de starboard.

source: Sets the avatar for webhook starboard messages.
pt_br: Define o avatar para os webhooks das mensagens de starboard.

source: This feature only works if `useWebhook` is enabled. Would you like to also enable this setting?
pt_br: Este recurso só funciona se `useWebhook` estiver habilitado. Você também gostaria de ativar essa configuração?

source: Webhooks have been enabled for {0}.
pt_br: Os webhooks foram ativados para {0}.

source: Avatar set!
pt_br: Avatar definido!

source: Avatar reset to default.
pt_br: Avatar redefinido para o padrão.

source: Sets the username for webhook starboard messages.
pt_br: Define o nome de usuário para os webhooks das mensagens de starboard.

source: Set the emoji to show next to the points.
pt_br: Defina o emoji para mostrar ao lado dos pontos.

source: Whether or not to show nicknames on starboard embeds.
pt_br: Se deve mostrar ou não apelidos nos conteúdos integrados de starboards.

source: Sets the embed color of starboard messages.
pt_br: Define a cor do conteúdo integrado das mensagens de starboard.

source: Sets the number of reactions a message needs.
pt_br: Define o número de reações de que uma mensagem precisa.

source: How few stars a message has before it is removed.
pt_br: Quantas estrelas a menos uma mensagem tem antes de ser removida.

source: Whether or not users can star their own messages.
pt_br: Se usuários podem ou não estrelar as próprias mensagens deles.

source: Whether or not bot messages can appear on the starboard.
pt_br: Se mensagens do bot podem aparecer ou não no starboard.

source: Whether messages must include an image.
pt_br: Se as mensagens estreladas devem ou não incluírem uma imagem.

source: A regex string that all messages must match.
pt_br: Uma string de regex à qual todas as mensagens devem corresponder.

source: A regex string that all messages must not match.
pt_br: Uma string de regex à qual todas as mensagens não devem corresponder.

source: Whether or not to mention the author of a starboard message.
pt_br: Se deve ou não mencionar o autor de uma mensagem de starboard.

source: Whether to automatically react to starboard messages.
pt_br: Se deve ou não reagir automaticamente às mensagens de starboard.

source: Whether to delete the starboard message if the original is.
pt_br: Se deve ou não excluir a mensagem de starboard se a original é excluída.

source: Whether to update starboard messages with edited content.
pt_br: Se deve ou não atualizar mensagens de starboard com conteúdo editado.

source: Set to True to disable gaining XP for this starboard.
pt_br: Defina como True (verdadeiro) para desativar o ganho de pontos de experiência para este starboard.

source: Whether or not invalid reactions should be removed.
pt_br: Se reações inválidas devem ser removidas ou não.

source: Whether or not the random command can pull from this starboard.
pt_br: Se a execução do comando random deve ou não incluir mensagens deste starboard.

source: Modify starEmojis for a starboard.
pt_br: Modifique starEmojis para um starboard.

source: Sets the starEmojis for a starboard.
pt_br: Define os starEmojis para um starboard.

source: Add a starEmoji.
pt_br: Adicione um starEmoji.

source: Removes a starEmoji.
pt_br: Remove um starEmoji.

source: Clears all starEmojis for a starboard.
pt_br: Limpa todos os starEmojis para um starboard.

source: Are you sure you want to clear all emojis for {0}?
pt_br: Você tem certeza de que deseja limpar todos os emojis para {0}?

source: `{0}` was deleted, so I removed that starboard.
pt_br: `{0}` foi excluído, então eu removi esse starboard.

source: Starboard message was deleted, so I autotrashed it.
pt_br: A mensagem de starboard foi excluída, então eu a destruí automaticamente.

source: Manage settings for the server.
pt_br: Gerencie configurações para o servidor.

source: Set the language for the server.
pt_br: Defina o idioma para o servidor.

source: Set the language for this server to {0}.
pt_br: Defini o idioma para este servidor como {0}.

source: Lists disabled commands.
pt_br: Lista comandos desabilitados.

source: No disabled commands. Disable a command with `{0}disable <command>`.
pt_br: Nenhum comando desabilitado. Desabilite um comando com `{0}disable <comando>`.

source: Disabled Commands:
pt_br: Comandos Desabilitados:

source: Disable a command with `{0}disable <command>`. Enable a command with `{0}enable <command>`.
pt_br: Desabilite um comando com `{0}disable <comando>`. Habilite um comando com `{0}enable <comando>`.

source: Disables a command.
pt_br: Desabilita um comando.

source: Disabled `{0}`.
pt_br: Desabilitei `{0}`.

source: Enables a command.
pt_br: Habilita um comando.

source: Enabled `{0}`.
pt_br: Habilitei `{0}`.

source: View guild settings.
pt_br: Veja as configurações do servidor.

source: enabled
pt_br: habilitado

source: disabled
pt_br: desabilitado

source: Settings for {0}:
pt_br: Configurações de {0}:

source: Sets the cooldown for xp.
pt_br: Define o tempo de espera para pontos de experiência.

source: Disables the XP cooldown.
pt_br: Desabilita o tempo de espera para pontos de experiência.

source: Disabled the XP cooldown.
pt_br: Desabiltei o tempo de espera para pontos de experiência.

source: Enables the XP cooldown.
pt_br: Habilita o tempo de espera para pontos de experiência.

source: Enabled the XP cooldown.
pt_br: Habilitei o tempo de espera para pontos de experiência.

source: Modify QuickActions.
pt_br: Modifique os QuickActions.

source: To modify these, run `{0}help qa`.
pt_br: Para modificá-los, execute `{0}help qa`.

source: Enables QuickActions.
pt_br: Habilita os QuickActions.

source: Enabled QuickActions.
pt_br: Habilitei os QuickActions.

source: Disables QuickActions.
pt_br: Desabilita os QuickActions.

source: Disabled QuickActions.
pt_br: Desabilitei os QuickActions.

source: Resets QuickActions to their default.
pt_br: Redefine os QuickActions para as opções padrões deles.

source: Reset quickActions.
pt_br: Redefina os QuickActions.

source: Sets the force QuickAction emoji.
pt_br: Define o emoji de QuickAction para forçar uma mensagem.

source: Set the force QuickAction to {0}.
pt_br: Defini o emoji de QuickAction para forçar uma mensagem como {0}.

source: Set the unforce QuickAction emoji.
pt_br: Define o emoji de QuickAction para desforçar uma mensagem.

source: Set the unforce QuickAction to {0}.
pt_br: Defini o emoji de QuickAction para desforçar uma mensagem como {0}.

source: Sets the freeze/unfreeze QuickAction emoji.
pt_br: Define o emoji de QuickAction para congelar/descongelar uma mensagem.

source: Set the freeze/unfreeze QuickAction to {0}.
pt_br: Defini o emoji de QuickAction para congelar/descongelar uma mensagem como {0}.

source: Sets the trash/untrash QuickAction emoji.
pt_br: Define o emoji de QuickAction para destruir/reconstruir uma mensagem.

source: Set the trash/untrash QuickAction to {0}.
pt_br: Defini o emoji de QuickAction para destruir/reconstruir uma mensagem como {0}.

source: Sets the recount QuickAction emoji.
pt_br: Define o emoji QuickAction para recontar.

source: Set the recount QuickAction to {0}.
pt_br: Defini o emoji QuickAction para recontar como {0}.

source: Sets the save QuickAction emoji.
pt_br: Define o emoji QuickAction para salvar.

source: Set the save QuickAction to {0}.
pt_br: Defini o emoji QuickAction para salvar como {0}.

source: List and manage prefixes.
pt_br: Liste e gerencie prefixos.

source: Prefixes for {0}:
pt_br: Prefixos de {0}:

source: Adds a prefix.
pt_br: Adiciona um prefixo.

source: `{0}` is too long (max length is 8 characters).
pt_br: `{0}` é muito longo (o comprimento máximo é 8 caracteres).

source: Added `{0}` to the prefixes.
pt_br: Adicionei `{0}` aos prefixos.

source: Removes a prefix.
pt_br: Remove um prefixo.

source: I found {0} matches for `{1}`. Please be more specific.
pt_br: Eu encontrei {0} correspondências para `{1}`. Por favor, seja mais específico.

source: No matches found for `{0}`.
pt_br: Nenhuma correspondência encontrada para `{0}`.

source: Did you want to remove `{0}` from the prefixes?
pt_br: Você quis remover `{0}` dos prefixos?

source: Removed `{0}` from the prefixes.
pt_br: Removi `{0}` dos prefixos.

source: Removes all prefixes and adds "sb!".
pt_br: Remove todos os prefixos e adiciona "sb!".

source: Are you sure you want to reset all prefixes?
pt_br: Tem certeza de que deseja redefinir todos os prefixos?

source: Cleared all prefixes and added `sb!`.
pt_br: Apaguei todos os prefixos e adicionei `sb!`.

source: Sets the channel for level up messages.
pt_br: Define o canal para mensagens de subida de nível.

source: I need the following permissions in {0} in order to set that as the levelUpChannel: {1}
pt_br: Preciso das seguintes permissões em {0} para definir isso como o levelUpChannel: {1}

source: Set the LevelUpChannel to {0}.
pt_br: Defini o LevelUpChannel como {0}.

source: Unset the LevelUpChannel.
pt_br: Remova o LevelUpChannel.

source: Whether or not to ping users when they level up.
pt_br: Se deve ou não mencionar usuários quando eles sobem de nível.

source: I will now ping users when the level up.
pt_br: Eu vou agora mencionar usuários quando eles sobem de nível.

source: I will not ping users when the level up.
pt_br: Eu não vou mais mencionar usuários quando eles sobem de nível.

source: Sets the channel where logs are sent to.
pt_br: Define o canal para o qual os registros são enviados.

source: I need the following permissions in {0} in order to set that as the log channel: {1}
pt_br: Preciso das seguintes permissões em {0} para definir isso como o canal de registro: {1}

source: Set the log channel to {0}.
pt_br: Defini o canal de registro como {0}.

source: This channel has been set as a log channel. I'll send errors and important info here.
pt_br: Este canal foi definido como o canal de registro. Vou enviar erros e informaçõesimportantes aqui.

source: Wether or not to allow commands from non-admins.
pt_br: Se deve ou não aceitar commandos de não administratores.

source: Set allowCommands to **{0}**.
pt_br: Defina allowCommands como **{0}**.

source: Fun commands for Starboard.
pt_br: Comandos divertidos para o bot Starboard.

source: Shows the servers top 200 users.
pt_br: Mostra os 200 melhores usuários no servidor com base nos pontos de experiência.

source: Leaderboard for {0}:
pt_br: Leaderboard de {0}:

source: Shows statistics for yourself or another user.
pt_br: Mostra estatísticas de você ou outro usuário.

source: **{0}** has no stats to show.
pt_br: **{0}** não tem estatísticas a mostrar.

source: That user has their profile set to private.
pt_br: Esse utilizador tem o seu perfil definido para privado.

source: Stats for {0}
pt_br: Estatísticas de {0}

source: Rank: **#{0}** Stars Given: **{1}** Stars Received: **{2}** XP: **{3}** Level: **{4}**
pt_br: Posição: **#{0}** Estrelas Dadas: **{1}** Estrelas Recebidas: **{2}** Pontos de Experiência: **{3}** Nível: **{4}**

source: Global Stats
pt_br: Estatísticas Globais

source: Total Stars Given: **{0}** Total Stars Received: **{1}** Total Votes: **{2}**
pt_br: Total de Estrelas Dadas: **{0}** Total de Estrelas Recebidas: **{1}** Total de Votos: **{2}**

source: Shows the most starred messages.
pt_br: Mostra as mensagens mais estreladas.

source: --place must be greater than 0
pt_br: --place deve ser maior que 0

source: Nothing to show.
pt_br: Nada a mostrar.

source: Shows a random starred message from the server.
pt_br: Mostra uma messagem estrelada aletatória do servidor.
