Repository: circuitsacul/Starboard-2
Catalog: app/locale/*/LC_MESSAGES/bot.po
Languages: pt_br

source: No messages were found that matched those requirements.
pt_br: Não foram encontradas mensagens que correspondessem a esses requisitos.

source: Something went wrong. Please try again.
pt_br: Alguma coisa deu errado. Por favor, tente novamente.

source: Tells you how starworthy a message is.
pt_br: Diz-lhe como uma mensagem é digna de uma estrela.

source: That message is {}% starworthy.
pt_br: Essa mensagem é {}% digna de uma estrela.

source: Saves a message to your DM's.
pt_br: Salva uma mensagem para as suas mensagens diretas.

source: You cannot save a trashed message.
pt_br: Você não pode salvar uma mensagem destruída.

source: That message was deleted, so you can't save it.
pt_br: Essa mensagem foi excluída, então você não pode salvá-la.

source: I can't DM you, so you can't save that message.
pt_br: Eu não posso te mandar uma mensagem direta, então você não pode salvar essa mensagem.

source: Manage PermRoles for a server.
pt_br: Gerencie PermRoles para um servidor.

source: Tests the permissions of a fake user with certain roles.
pt_br: Testa as permissões de um usuário falso com certos cargos.

source: Dummy Check
pt_br: Verificação Fictícia

source: Channel: {0} Starboard: {1} Roles: {2}
pt_br: Canal: {0} Starboard: {1} Cargos: {2}

source: Lists PermGroups, or views settings for a PermGroup.
pt_br: Lista PermGroups ou vê configurações para um PermGroup.

source: You have no PermGroups.
pt_br: Você não tem PermGroups.

source: PermGroups for {0}
pt_br: PermGroups de {0}

source: If you're looking for the PermRoles of this PermGroup, run {0}.
pt_br: Se você está procurando os PermRoles deste PermGroup, execute {0}.

source: Add a PermGroup.
pt_br: Adicione um PermGroup.

source: Created PermGroup {0}
pt_br: Criei o PermGroup {0}

source: Deletes a PermGroup.
pt_br: Excluí um PermGroup.

source: Deleted PermGroup **{0}**.
pt_br: Apaguei o PermGroup **{0}**.

source: Sets the position of a PermGroup.
pt_br: Define a posição de um PermGroup.

source: Moved the PermGroup **{0}** from {1} to {2}.
pt_br: Movi o PermGroup **{0}** de {1} para {2}.

source: Manage the channels that a PermGroup affects.
pt_br: Gerencie os canais que um PermGroup afeta.

source: Adds channel(s) to the list of channels for a PermGroup.
pt_br: Adiciona canal(is) à lista de canais em um PermGroup.

source: Added {0} to the channels on PermGroup **{1}**.
pt_br: Adicionei {0} aos canais no PermGroup **{1}**.

source: Removes channel(s) from the list of channels on a PermGroup.
pt_br: Remove canal(is) da lista de canais em um PermGroup.

source: Removed {0} from the channels on PermGroup **{1}**.
pt_br: Removi {0} dos canais no PermGroup **{1}**.

source: Clears all channels from a PermGroup.
pt_br: Limpa todos os canais de um PermGroup.

source: Are you sure you want to clear all channels for the PermGroup **{0}**?
pt_br: Você tem certeza de que você quer limpar todos os canais do PermGroup **{0}**?

source: Cleared all channels for the PermGroup **{0}**.
pt_br: Limpei todos os canais do PermGroup **{0}**.

source: Manage the starboards that a PermGroup affects.
pt_br: Gerencie os starboards que um PermGroup afeta.

source: Adds starboard(s) to the list of starboards for a PermGroup.
pt_br: Adiciona starboard(s) à lista de starboards de um PermGroup.

source: Added {0} to the starboards on PermGroup **{1}**.
pt_br: Adicionei {0} aos starboards no PermGroup **{1}**.

source: Removes starboard(s) from the list of starboars on a PermGroup.
pt_br: Remove starboard(s) da lista de starboards em um PermGroup.

source: Removed {0} from the starboards on PermGroup **{1}**.
pt_br: Removi {0} dos starboards no PermGroup **{1}**.

source: Clears all starboards on a PermGroup.
pt_br: Limpa todos os starboards em um PermGroup.

source: Are you sure you want to clear all starboards for the PermGroup **{0}**?
pt_br: Você tem certeza de que você quer limpar todos os starboards do PermGroup **{0}**?

source: Cleared all starboards for PermGroup **{0}**.
pt_br: Limpei todos os starboards do PermGroup **{0}**.

source: Manage/View PermRoles for a PermGroup.
pt_br: Gerencie/Veja PermRoles de um PermGroup.

source: There are no PermRoles for the PermGroup **{0}**.
pt_br: Não há PermRoles para o PermGroup **{0}**.

source: PermRoles for {0}
pt_br: PermRoles para {0}

source: Adds a PermRole to a PermGroup.
pt_br: Adiciona um PermRole para um PermGroup.

source: {0} is now a PermRole on the PermGroup **{1}**.
pt_br: {0} é agora um PermRole no PermGroup **{1}**.

source: Removes a PermRole from a PermGroup.
pt_br: Remove um PermRole de um PermGroup.

source: {0} is no longer a PermRole on the PermGroup **{1}**.
pt_br: {0} não é mais um PermRole no PermGroup **{1}**.

source: Changes the position of a PermRole in a PermGroup.
pt_br: Muda uma posição de um PermRole em um PermGroup.

source: Moved the PermRole {0} from {1} to {2}.
pt_br: Movi o PermRole {0} de {1} para {2}.

source: Sets the allowCommands permission for a PermRole.
pt_br: Define a permissão allowCommands para um PermRole.

source: Sets the onStarboard permission for a PermRole.
pt_br: Define a permissão onStarboard para um PermRole.

source: Sets the giveStars permission for a PermRole.
pt_br: Define a permissão giveStars para um PermRole.

source: Sets the gainXP permission for a PermRole.
pt_br: Define a permissão gainXP para um PermRole.

source: Sets the posRoles permission for a PermRole.
pt_br: Define a permissão posRoles para um PermRole.

source: Sets the xpRoles permission for a PermRole.
pt_br: Define a permissão xpRoles para um PermRole.

source: Slash commands.
pt_br: Comandos de barra (/).

source: Get a link for authorizing slash commands.
pt_br: Obtenha um link para autorizar comandos de barra.

source: Try running `/ping` to see if slash commands are working. If not, a server admin can use [this link]({}) to give me the proper permissions.
pt_br: Tente executar `/ping` para ver se comandos de barra estão funcionando. Se não, um administrator do servidor pode usar [this link]({}) para me dar as permissões apropriadas.

source: Manage personal settings.
pt_br: Gerencie configurações pessoais:

source: Sets your language.
pt_br: Define o seu idioma.

source: Set your language to {0}.
pt_br: Defini o seu idioma como {0}.

source: Whether or not your profile is visible to others.
pt_br: Se seu perfil deve ou não ser vísivel para outros usuários.

source: Your profile is now public.
pt_br: Seu perfil é agora público.

source: Your profile is no longer public.
pt_br: Seu perfil não é mais público.

source: Shows your settings.
pt_br: Mostra as suas configurações.

source: Settings
pt_br: Configurações

source: Language: {0} Public Profile: {1}
pt_br: Idioma: {0} Perfil Público: {1}

source: Premium Info
pt_br: Informação sobre a Versão Premium:

source: Manage the channel whitelist/blacklist for starboards.
pt_br: Gerencie a lista branca/negra para starboards.

source: Lists the channel blacklist/whitelist for a starboard.
pt_br: Lista a lista branca/negra para um starboard.

source: (All channels are blacklisted, since there are whitelisted channels)
pt_br: (Todos os canais estão na lista negra, já que há canais na lista branca)

source: Blacklist/Whitelist for {0}
pt_br: Lista Negra/Branca de {0}

source: Blacklisted Channels:
pt_br: Canais na Lista Negra:

source: Whitelisted Channels:
pt_br: Canais na Lista Branca:

source: Adds a channel to the blacklist.
pt_br: Adiciona um canal à lista negra.

source: Added {0} to the blacklist on {1}.
pt_br: Adicionei {0} à lista negra em {1}.

source: Removes a channel from the blacklist.
pt_br: Remove um canal da lista negra.

source: Removed {0} from the blacklist on {1}.
pt_br: Removi {0} da lista negra em {1}.

source: Removes everything from the blacklist.
pt_br: Remove tudo da lista negra.

source: Are you sure you want to clear the blacklist for {0}?
pt_br: Você tem certeza de que você quer limpar a lista negra de {0}?

source: Cleared the blacklist for {0}.
pt_br: Limpei a lista negra de {0}.

source: Shows the channel blacklist/whitelist for a starboard.
pt_br: Mostra a lista negra/branca de canais para um starboard.

source: Adds a channel to the whitelist.
pt_br: Adiciona um canal à lista branca.

source: Added {0} to the whitelist for {1}.
pt_br: Adicionei {0} à lista branca de {1}.

source: Removes a channel from the whitelist.
pt_br: Remove um canal da lista branca.

source: Removed {0} from the whitelist on {1}.
pt_br: Removi {0} da lista branca em {1}.

source: Clears the whitelist for a starboard.
pt_br: Limpa a lista branca de um starboard.

source: Are you sure you want to clear the whitelist for {0}?
pt_br: Você tem certeza de que você quer limpar a lista branca de {0}?

source: Cleared the whitelist for {0}.
pt_br: Limpei a lista branca de {0}.

source: Manage AwardRoles.
pt_br: Gerencie AwardRoles.

source: View and manage PosRoles for your server. (PosRoles stands for Position-based Award Roles)
pt_br: Visualize e gerencie PosRoles do seu servidor.

source: This server has no PosRoles set.
pt_br: Este servidor não tem PosRoles definidos.

source: Stack PosRoles: **{}**
pt_br: Empilhar PosRoles: **{}**

source: Whether or not to stack PosRoles.
pt_br: Se deve ou não empilhar PosRoles.

source: PosRoles will be stacked from now on.
pt_br: PosRoles serão empilhados a partir de agora.

source: I will no longer stack PosRoles.
pt_br: Eu não mais empilhar PosRoles.

source: Adds a PosRole.
pt_br: Adiciona um PosRole.

source: Created PosRole **{0}**.
pt_br: Criei o PosRole **{0}**.

source: Removes a PosRole.
pt_br: Remove um PosRole.

source: Deleted PosRole **{0}**.
pt_br: Excluí o PosRole **{0}**.

source: Sets the max users for a PosRole.
pt_br: Define o número máximo de usuários para um PosRole.

source: Set the maximum users for the PosRole **{0}** to {1}.
pt_br: Defina o número máximo de usuários para o PosRole **{0}** como {1}.

source: View and manage XPRoles for your server.
pt_br: Veja e gerencie XPRoles do seu servidor.

source: This server has no XP Roles.
pt_br: Este servidor não tem XPRoles.

source: Stack XPRoles: **{}**
pt_br: Empilhar XPRoles: **{}**

source: Whether or not to stack XPRoles.
pt_br: Se deve ou não empilhar XPRoles.

source: XPRoles will be stacked from now on.
pt_br: XPRoles serão empilhados a partir de agora.

source: I will no longer stack XPRoles.
pt_br: Eu não vou mais empilhar XPRoles.

source: Adds an XPRole.
pt_br: Adiciona um XPRole.

source: Created XPRole **{0}**.
pt_br: Criei o XPRole **{0}**.

source: Removes an XPRole.
pt_br: Remove um XPRole.

source: Deleted the XPRole **{0}**.
pt_br: Excluí o XPRole **{0}**.

source: Sets the ammount of xp needed to gain an XPRole.
pt_br: Define a quantidade de pontos de experiência necessária para ganhar um XPRole.

source: Set the needed xp to {0} for the XPRole **{1}**.
pt_br: Defini os pontos de experiência necessários como {0} para o XPRole **{1}**.

source: The role `{role.name}` was deleted, so I removed that PosRole.
pt_br: O cargo `{role.name}` foi excluído, então eu removi esse PosRole.

source: The role `{role.name}` was deleted, so I removed that XPRole.
pt_br: O cargo `{role.name}` foi excluído, então eu removi esse XPRole.

source: I tried to match `{0}` to [a message]({1.jump_url}), but it took too long. Try improving the efficiency of your regex, and feel free to join the support server for help.
pt_br: Tentei corresponder `{0}` a [uma mensagem]({1.jump_url}), mas demorou muito tempo. Tente melhorar a eficiência de seu regex, e sinta-se à vontade para juntar-se ao servidor de suporte para ajuda.

source: Messages must be at least {0} characters
pt_br: Mensagens devem ter pelo menos {0} caracteres.

source: Messages must match `{0}`
pt_br: Mensagens devem corresponder a `{0}`

source: Messages must not match `{0}`
pt_br: Mensagens não devem corresponder a `{0}`

source: I tried to delete [a message]({0.jump_url}) that didn't meet the requirements of {0.channel.mention}, but I don't have the proper permissions.
pt_br: Tentei apagar [uma mensagem]({0.jump_url}) que não atendeu as exigências do canal {0.channel.mention}, mas eu não tenho as permissões apropriadas.

source: Your message in {0} was deleted, because {1}. Here is your message:
pt_br: Sua mensagem em {0} foi excluída, porque {1}. Aqui está a sua messagem:

source: `{0}` was deleted so I removed that AutoStar channel.
pt_br: `{0}` foi excluído, então eu removi esse canal AutoStar.

source: Manage AutoStar channels.
pt_br: Gerencie canais AutoStar.

source: You do not have any AutoStar channels. use `{0}asc add <channel>` to create one.
pt_br: Você não tem nenhum canal AutoStar. Use `{0}asc add <canal>` para criar one.

source: AutoStar channels
pt_br: Canais AutoStar

source: This lists all AutoStar channels and their most important settings. Use `{0}asc <aschannel>` to view all settings.
pt_br: Isto lista todos os canais AutoStar e as configurações mais importantes deles. Utilize `{0}asc <canal autoStar>` para visualizar todas as configurações.

source: Adds an AutoStar channel.
pt_br: Adiciona um canal AutoStar.

source: Created AutoStar channel {0}.
pt_br: Criei o canal AutoStar {0}.

source: Removes an AutoStar channel.
pt_br: Remove um canal AutoStar.

source: Deleted AutoStar channel {0}.
pt_br: Excluí o canal AutoStar {0}.

source: Modify the emojis for AutoStar channels.
pt_br: Modifique os emojis para os canais AutoStar.

source: Sets the emojis for an AutoStar channel.
pt_br: Define os emojis para um canal AutoStar.

source: Adds an emoji to an AutoStar channel.
pt_br: Adiciona um emoji a um canal AutoStar.

source: Removes an emojis from an AutoStar channel.
pt_br: Remove um emoji de um canal AutoStar.

source: Removes all emojis from an AutoStar channel.
pt_br: Remove todos os emojis de um canal AutoStar.

source: Sets the minimum number of characters for messages.
pt_br: Define o número mínimo de caracteres para mensagens.

source: Whether or not messages must include an image.
pt_br: Se mensagens devem ou não incluir uma imagem.

source: Whether or not to delete invalid messages.
pt_br: Se deve ou não excluir mensagens inválidas.

source: Premium related commands.
pt_br: Comandos relacionados à versão premium.

source: Refresh your donor/patron roles.
pt_br: Atualize seus cargos de doador/patrocinador.

source: Your roles should update momentarily.
pt_br: Seus cargos devem ser atualizados momentaneamente.

source: We received your donation of ${0} through donatebot, and you have gained {1} credit(s). If you have any questions feel free to dm Circuit#5585. Thanks for your donation!
pt_br: Recebemos sua doação de ${0} através do Donate Bot, e você ganhou {1} crédito(s)". Se você tiver alguma dúvida, sinta-se à vontade para enviar uma mensagem direta a Circuit#5585. Obrigado por sua doação!

source: Looks like your payment on patreon has been declined. Please make sure that you entered your info on patreon correctly, and feel free to DM @Circuit#5585 for help.
pt_br: Parece que o seu pagamento no Patreon foi recusado. Por favor, certifique-se de que você inseriu suas informações no Patreon corretamente, e sinta-se à vontade para enviar uma mensagem direta a @Circuit#5585 para ajuda.

source: Thanks for becoming a patron! Each $ that is sent through patreon will be converted to 1 credit. DM `@Circuit#5585` if you have any questions. Your support is greatly appreciated.
pt_br: Obrigado por se tornar um patrocinador! Cada dólar que é enviado através do Patreon será convertido em 1 crédito. DM `@Circuit#5585` se você tiver alguma dúvida. Seu apoio é muito apreciado.

source: Just wanted to alert you that your montly pledge on Patreon has changed from ${0} to ${1}. Thanks for supporting Starboard!
pt_br: Só queria te alertar de que sua membresia mensal no Patreon mudou de ${0} para ${1}. Obrigado por apoiar o Starboard!

source: It looks like you removed your pledge on Patreon. We're sorry to see you go, but we are still grateful for all of your previous support. You won't gain any more credits automatically, but you will *not* loose any you currently have.
pt_br: Parece que você retirou sua membresia mensal no Patreon. Nós lamentamos vê-lo partir, mas ainda nós somos gratos por todo seu apoio anterior. Você não ganhará mais créditos automaticamente, mas *não* perderá nenhum que você tem atualmente.

source: My prefix is `{0}`.
pt_br: Meu prefixo é `{0}`.

source: I don't have permission to send messages in {0}, so I can't respond to your command.
pt_br: Eu não tenho permissão para enviar mensagens em {0}, então eu não posso responder ao seu comando.

source: Something's Not Right
pt_br: Alguma Coisa Não Está Certa

source: Something went wrong while running this command. If the problem persists, please report this in the support server.
pt_br: Algo deu errado durante a execução deste comando. Se o problema persistir, por favor informe isto no servidor de suporte.

source: {0} Leveled up!
pt_br: {0} Subiu de nível!

source: They are now level **{0}**!
pt_br: Ele(a) está agora no nível {0}**!

source: Basic informational commands.
pt_br: Comandos informativos básicos.

source: A Starboard is a bot that allows users of a server to "vote" to "pin" a message. The main idea is this: - You set a channel as the starboard, typically called `#starboard` - You set an emoji for voting to pin messages, usually :star: - You set a limit (called requiredStars on this bot) that tells Starboard how many reactions (of the emoji you set) a message needs before it is sent to the starboard. Once a message reaches the requiredStars limit in reactions, Starboard will essentially copy the message and repost it in your starboard.
pt_br: Um Starboard é um bot que permite aos usuários de um servidor "votar" para "fixar" uma mensagem. A ideia principal é esta: - Você define um canal como o starboard, normalmente chamado `#starboard` - Você define um emoji para votar para fixar mensagens, geralmente o emoji :star: - Você define um limite (chamado de requiredStars neste bot) que diz ao Starboard de quantas reações (do emoji que você definir) uma mensagem precisa antes que ela seja enviada ao starboard. Assim que uma mensagem atingir o limite requiredStars em reações, o Starboard vai essencialmente copiar a mensagem e a repostar em seu starboard.

source: Show credits.
pt_br: Mostre créditos.

source: Starboard Credits
pt_br: Créditos de Starboard:

source: Owner(s)
pt_br: Dono(s)

source: Developer(s)
pt_br: Desenvolvedor(es)

source: Translator(s)
pt_br: Tradutor(es)

source: Get help with Starboard.
pt_br: Consiga ajuda com o Starboard.

source: To see a complete command list, run `{1}commands`. To see a list of disabled commands, run `{1}disabled`. To list all prefixes, run `{1}prefixes`. For a list of useful links, run `{1}links`
pt_br: Para ver uma lista de comandos completa, execute `{1}commands`. Para ver uma lista de comandos desabilitados, execute `{1}disabled`. Para listar todos os prefixos, execute `{1}prefixes`. Para uma lista de links úteis, execute `{1}links`

source: What is a Starboard?
pt_br: O que é um Starboard?

source: See a list of commands.
pt_br: Veja uma lista de comandos.

source: Shows bot statistics.
pt_br: Mostra as estatísticas do bot.

source: Bot Stats
pt_br: Estatísticas do Bot

source: Guilds: **{0}** Users: **{1}** Clusters: **{2}** Shards: **{3}**
pt_br: Servidores: **{0}** Usuários: **{1}** Clusters: **{2}** Shards: **{3}**

source: Shows current clusters and shards latency.
pt_br: Mostra a latência atual dos clusters e shards.

source: Pinging...
pt_br: Pingando...

source: Editing...
pt_br: Editando...

source: Pong!
pt_br: Pongue!

source: Send: {0}ms Edit: {1}ms Delete: {2}ms
pt_br: Enviar: {0}ms Editar: {1}ms Excluir: {2}ms

source: Lists important/useful links.
pt_br: Lista links importantes/úteis.

source: Important Links
pt_br: Links Importantes

source: **[Documentation]({0.DOCS})** **[Support Server]({0.SUPPORT_INVITE})** **[Invite Starboard]({0.BOT_INVITE})**
pt_br: **[Documentação]({0.DOCS})** **[Servidor de Suporte]({0.SUPPORT_INVITE})** **[Convide o Starboard]({0.BOT_INVITE})**

source: Support Starboard
pt_br: Apoie o Starboard

source: [Become a Patron]({0.PATREON_LINK})**
pt_br: [Torne-se um Patrocinador]({0.PATREON_LINK})**

source: Vote Links
pt_br: Links para Votar

source: Review Links
pt_br: Links de Análise

source: View vote links and number of times you've voted.
pt_br: Veja links para votar e o número de vezes que você votou.

source: {0} is a bot. How many times do you think they've voted?
pt_br: {0} é um bot. Quantas vezes você acha que ele já votou?

source: Vote for Starboard
pt_br: Vote no Starboard

source: You have voted **{0}** time(s).
pt_br: Você votou **{0}** vez(es).

source: **{0}** has voted **{1}** time(s).
pt_br: **{0}** votou **{1}** vez(es).

source: Utility and moderation commands.
pt_br: Comandos de utilidade e moderação.
